FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/component/component_sercom.h
/**
 * \file
 *
 * \brief Component description for SERCOM
 *
 * Copyright (c) 2013 Atmel Corporation. All rights reserved.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 * 3. The name of Atmel may not be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * 4. This software may only be redistributed and used in connection with an
 *    Atmel microcontroller product.
 *
 * THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * EXPRESSLY AND SPECIFICALLY DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
 * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAMD20_SERCOM_COMPONENT_
#define _SAMD20_SERCOM_COMPONENT_

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR SERCOM */
/* ========================================================================== */
/** \addtogroup SAMD20_SERCOM Serial Communication Interface */
/*@{*/

#define REV_SERCOM    0x101

/* -------- SERCOM_I2CM_CTRLA : (SERCOM Offset: 0x00) (R/W 32) I2CM I2CM Control Register A -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t SWRST : 1;    /*!< bit:      0  Software Reset                     */
            uint32_t ENABLE : 1;   /*!< bit:      1  Enable                             */
            uint32_t MODE : 3;     /*!< bit:  2.. 4  Operating Mode                     */
            uint32_t : 2;          /*!< bit:  5.. 6  Reserved                           */
            uint32_t RUNSTDBY : 1; /*!< bit:      7  Run during Standby                 */
            uint32_t : 8;          /*!< bit:  8..15  Reserved                           */
            uint32_t PINOUT : 1;   /*!< bit:     16  Pin Usage                          */
            uint32_t : 3;          /*!< bit: 17..19  Reserved                           */
            uint32_t SDAHOLD : 2;  /*!< bit: 20..21  SDA Hold Time                      */
            uint32_t : 6;          /*!< bit: 22..27  Reserved                           */
            uint32_t INACTOUT : 2; /*!< bit: 28..29  Inactive Bus Timeout               */
            uint32_t LOWTOUT : 1;  /*!< bit:     30  SCL Low Timeout                    */
            uint32_t : 1;          /*!< bit:     31  Reserved                           */
        } bit;                     /*!< Structure used for bit  access                  */
        uint32_t reg;              /*!< Type      used for register access              */
    } SERCOM_I2CM_CTRLA_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SERCOM_I2CM_CTRLA_OFFSET                  0x00       /**< \brief (SERCOM_I2CM_CTRLA offset) I2CM Control Register A */
#define SERCOM_I2CM_CTRLA_RESETVALUE              0x00000000 /**< \brief (SERCOM_I2CM_CTRLA reset_value) I2CM Control Register A */

#define SERCOM_I2CM_CTRLA_SWRST_Pos               0          /**< \brief (SERCOM_I2CM_CTRLA) Software Reset */
#define SERCOM_I2CM_CTRLA_SWRST                   ( 0x1u << SERCOM_I2CM_CTRLA_SWRST_Pos )
#define SERCOM_I2CM_CTRLA_ENABLE_Pos              1          /**< \brief (SERCOM_I2CM_CTRLA) Enable */
#define SERCOM_I2CM_CTRLA_ENABLE                  ( 0x1u << SERCOM_I2CM_CTRLA_ENABLE_Pos )
#define SERCOM_I2CM_CTRLA_MODE_Pos                2          /**< \brief (SERCOM_I2CM_CTRLA) Operating Mode */
#define SERCOM_I2CM_CTRLA_MODE_Msk                ( 0x7u << SERCOM_I2CM_CTRLA_MODE_Pos )
#define SERCOM_I2CM_CTRLA_MODE( value )    ( ( SERCOM_I2CM_CTRLA_MODE_Msk & ( ( value ) << SERCOM_I2CM_CTRLA_MODE_Pos ) ) )
#define   SERCOM_I2CM_CTRLA_MODE_USART_EXT_CLK    ( 0x0u << 2 ) /**< \brief (SERCOM_I2CM_CTRLA) USART mode with external clock */
#define   SERCOM_I2CM_CTRLA_MODE_USART_INT_CLK    ( 0x1u << 2 ) /**< \brief (SERCOM_I2CM_CTRLA) USART mode with internal clock */
#define   SERCOM_I2CM_CTRLA_MODE_SPI_SLAVE        ( 0x2u << 2 ) /**< \brief (SERCOM_I2CM_CTRLA) SPI mode with external clock */
#define   SERCOM_I2CM_CTRLA_MODE_SPI_MASTER       ( 0x3u << 2 ) /**< \brief (SERCOM_I2CM_CTRLA) SPI mode with internal clock */
#define   SERCOM_I2CM_CTRLA_MODE_I2C_SLAVE        ( 0x4u << 2 ) /**< \brief (SERCOM_I2CM_CTRLA) I2C mode with external clock */
#define   SERCOM_I2CM_CTRLA_MODE_I2C_MASTER       ( 0x5u << 2 ) /**< \brief (SERCOM_I2CM_CTRLA) I2C mode with internal clock */
#define SERCOM_I2CM_CTRLA_RUNSTDBY_Pos            7             /**< \brief (SERCOM_I2CM_CTRLA) Run during Standby */
#define SERCOM_I2CM_CTRLA_RUNSTDBY                ( 0x1u << SERCOM_I2CM_CTRLA_RUNSTDBY_Pos )
#define SERCOM_I2CM_CTRLA_PINOUT_Pos              16            /**< \brief (SERCOM_I2CM_CTRLA) Pin Usage */
#define SERCOM_I2CM_CTRLA_PINOUT                  ( 0x1u << SERCOM_I2CM_CTRLA_PINOUT_Pos )
#define SERCOM_I2CM_CTRLA_SDAHOLD_Pos             20            /**< \brief (SERCOM_I2CM_CTRLA) SDA Hold Time */
#define SERCOM_I2CM_CTRLA_SDAHOLD_Msk             ( 0x3u << SERCOM_I2CM_CTRLA_SDAHOLD_Pos )
#define SERCOM_I2CM_CTRLA_SDAHOLD( value )     ( ( SERCOM_I2CM_CTRLA_SDAHOLD_Msk & ( ( value ) << SERCOM_I2CM_CTRLA_SDAHOLD_Pos ) ) )
#define SERCOM_I2CM_CTRLA_INACTOUT_Pos            28 /**< \brief (SERCOM_I2CM_CTRLA) Inactive Bus Timeout */
#define SERCOM_I2CM_CTRLA_INACTOUT_Msk            ( 0x3u << SERCOM_I2CM_CTRLA_INACTOUT_Pos )
#define SERCOM_I2CM_CTRLA_INACTOUT( value )    ( ( SERCOM_I2CM_CTRLA_INACTOUT_Msk & ( ( value ) << SERCOM_I2CM_CTRLA_INACTOUT_Pos ) ) )
#define SERCOM_I2CM_CTRLA_LOWTOUT_Pos             30          /**< \brief (SERCOM_I2CM_CTRLA) SCL Low Timeout */
#define SERCOM_I2CM_CTRLA_LOWTOUT                 ( 0x1u << SERCOM_I2CM_CTRLA_LOWTOUT_Pos )
#define SERCOM_I2CM_CTRLA_MASK                    0x7031009Fu /**< \brief (SERCOM_I2CM_CTRLA) MASK Register */

