FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/component/component_sercom.h
/* -------- SERCOM_I2CS_CTRLA : (SERCOM Offset: 0x00) (R/W 32) I2CS I2CS Control Register A -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t SWRST : 1;    /*!< bit:      0  Software Reset                     */
            uint32_t ENABLE : 1;   /*!< bit:      1  Enable                             */
            uint32_t MODE : 3;     /*!< bit:  2.. 4  Operating Mode                     */
            uint32_t : 2;          /*!< bit:  5.. 6  Reserved                           */
            uint32_t RUNSTDBY : 1; /*!< bit:      7  Run during Standby                 */
            uint32_t : 8;          /*!< bit:  8..15  Reserved                           */
            uint32_t PINOUT : 1;   /*!< bit:     16  Pin Usage                          */
            uint32_t : 3;          /*!< bit: 17..19  Reserved                           */
            uint32_t SDAHOLD : 2;  /*!< bit: 20..21  SDA Hold Time                      */
            uint32_t : 8;          /*!< bit: 22..29  Reserved                           */
            uint32_t LOWTOUT : 1;  /*!< bit:     30  SCL Low Timeout                    */
            uint32_t : 1;          /*!< bit:     31  Reserved                           */
        } bit;                     /*!< Structure used for bit  access                  */
        uint32_t reg;              /*!< Type      used for register access              */
    } SERCOM_I2CS_CTRLA_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SERCOM_I2CS_CTRLA_OFFSET                  0x00       /**< \brief (SERCOM_I2CS_CTRLA offset) I2CS Control Register A */
#define SERCOM_I2CS_CTRLA_RESETVALUE              0x00000000 /**< \brief (SERCOM_I2CS_CTRLA reset_value) I2CS Control Register A */

#define SERCOM_I2CS_CTRLA_SWRST_Pos               0          /**< \brief (SERCOM_I2CS_CTRLA) Software Reset */
#define SERCOM_I2CS_CTRLA_SWRST                   ( 0x1u << SERCOM_I2CS_CTRLA_SWRST_Pos )
#define SERCOM_I2CS_CTRLA_ENABLE_Pos              1          /**< \brief (SERCOM_I2CS_CTRLA) Enable */
#define SERCOM_I2CS_CTRLA_ENABLE                  ( 0x1u << SERCOM_I2CS_CTRLA_ENABLE_Pos )
#define SERCOM_I2CS_CTRLA_MODE_Pos                2          /**< \brief (SERCOM_I2CS_CTRLA) Operating Mode */
#define SERCOM_I2CS_CTRLA_MODE_Msk                ( 0x7u << SERCOM_I2CS_CTRLA_MODE_Pos )
#define SERCOM_I2CS_CTRLA_MODE( value )    ( ( SERCOM_I2CS_CTRLA_MODE_Msk & ( ( value ) << SERCOM_I2CS_CTRLA_MODE_Pos ) ) )
#define   SERCOM_I2CS_CTRLA_MODE_USART_EXT_CLK    ( 0x0u << 2 ) /**< \brief (SERCOM_I2CS_CTRLA) USART mode with external clock */
#define   SERCOM_I2CS_CTRLA_MODE_USART_INT_CLK    ( 0x1u << 2 ) /**< \brief (SERCOM_I2CS_CTRLA) USART mode with internal clock */
#define   SERCOM_I2CS_CTRLA_MODE_SPI_SLAVE        ( 0x2u << 2 ) /**< \brief (SERCOM_I2CS_CTRLA) SPI mode with external clock */
#define   SERCOM_I2CS_CTRLA_MODE_SPI_MASTER       ( 0x3u << 2 ) /**< \brief (SERCOM_I2CS_CTRLA) SPI mode with internal clock */
#define   SERCOM_I2CS_CTRLA_MODE_I2C_SLAVE        ( 0x4u << 2 ) /**< \brief (SERCOM_I2CS_CTRLA) I2C mode with external clock */
#define   SERCOM_I2CS_CTRLA_MODE_I2C_MASTER       ( 0x5u << 2 ) /**< \brief (SERCOM_I2CS_CTRLA) I2C mode with internal clock */
#define SERCOM_I2CS_CTRLA_RUNSTDBY_Pos            7             /**< \brief (SERCOM_I2CS_CTRLA) Run during Standby */
#define SERCOM_I2CS_CTRLA_RUNSTDBY                ( 0x1u << SERCOM_I2CS_CTRLA_RUNSTDBY_Pos )
#define SERCOM_I2CS_CTRLA_PINOUT_Pos              16            /**< \brief (SERCOM_I2CS_CTRLA) Pin Usage */
#define SERCOM_I2CS_CTRLA_PINOUT                  ( 0x1u << SERCOM_I2CS_CTRLA_PINOUT_Pos )
#define SERCOM_I2CS_CTRLA_SDAHOLD_Pos             20            /**< \brief (SERCOM_I2CS_CTRLA) SDA Hold Time */
#define SERCOM_I2CS_CTRLA_SDAHOLD_Msk             ( 0x3u << SERCOM_I2CS_CTRLA_SDAHOLD_Pos )
#define SERCOM_I2CS_CTRLA_SDAHOLD( value )    ( ( SERCOM_I2CS_CTRLA_SDAHOLD_Msk & ( ( value ) << SERCOM_I2CS_CTRLA_SDAHOLD_Pos ) ) )
#define SERCOM_I2CS_CTRLA_LOWTOUT_Pos             30          /**< \brief (SERCOM_I2CS_CTRLA) SCL Low Timeout */
#define SERCOM_I2CS_CTRLA_LOWTOUT                 ( 0x1u << SERCOM_I2CS_CTRLA_LOWTOUT_Pos )
#define SERCOM_I2CS_CTRLA_MASK                    0x4031009Fu /**< \brief (SERCOM_I2CS_CTRLA) MASK Register */

/* -------- SERCOM_SPI_CTRLA : (SERCOM Offset: 0x00) (R/W 32) SPI SPI Control Register A -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t SWRST : 1;    /*!< bit:      0  Software Reset                     */
            uint32_t ENABLE : 1;   /*!< bit:      1  Enable                             */
            uint32_t MODE : 3;     /*!< bit:  2.. 4  Operating Mode                     */
            uint32_t : 2;          /*!< bit:  5.. 6  Reserved                           */
            uint32_t RUNSTDBY : 1; /*!< bit:      7  Run during Standby                 */
            uint32_t : 8;          /*!< bit:  8..15  Reserved                           */
            uint32_t DOPO : 1;     /*!< bit:     16  Data Out Pinout                    */
            uint32_t : 3;          /*!< bit: 17..19  Reserved                           */
            uint32_t DIPO : 2;     /*!< bit: 20..21  Data In Pinout                     */
            uint32_t : 2;          /*!< bit: 22..23  Reserved                           */
            uint32_t FORM : 4;     /*!< bit: 24..27  Frame Format                       */
            uint32_t CPHA : 1;     /*!< bit:     28  Clock Phase                        */
            uint32_t CPOL : 1;     /*!< bit:     29  Clock Polarity                     */
            uint32_t DORD : 1;     /*!< bit:     30  Data Order                         */
            uint32_t : 1;          /*!< bit:     31  Reserved                           */
        } bit;                     /*!< Structure used for bit  access                  */
        uint32_t reg;              /*!< Type      used for register access              */
    } SERCOM_SPI_CTRLA_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SERCOM_SPI_CTRLA_OFFSET                  0x00       /**< \brief (SERCOM_SPI_CTRLA offset) SPI Control Register A */
#define SERCOM_SPI_CTRLA_RESETVALUE              0x00000000 /**< \brief (SERCOM_SPI_CTRLA reset_value) SPI Control Register A */

#define SERCOM_SPI_CTRLA_SWRST_Pos               0          /**< \brief (SERCOM_SPI_CTRLA) Software Reset */
#define SERCOM_SPI_CTRLA_SWRST                   ( 0x1u << SERCOM_SPI_CTRLA_SWRST_Pos )
#define SERCOM_SPI_CTRLA_ENABLE_Pos              1          /**< \brief (SERCOM_SPI_CTRLA) Enable */
#define SERCOM_SPI_CTRLA_ENABLE                  ( 0x1u << SERCOM_SPI_CTRLA_ENABLE_Pos )
#define SERCOM_SPI_CTRLA_MODE_Pos                2          /**< \brief (SERCOM_SPI_CTRLA) Operating Mode */
#define SERCOM_SPI_CTRLA_MODE_Msk                ( 0x7u << SERCOM_SPI_CTRLA_MODE_Pos )
#define SERCOM_SPI_CTRLA_MODE( value )    ( ( SERCOM_SPI_CTRLA_MODE_Msk & ( ( value ) << SERCOM_SPI_CTRLA_MODE_Pos ) ) )
#define   SERCOM_SPI_CTRLA_MODE_USART_EXT_CLK    ( 0x0u << 2 ) /**< \brief (SERCOM_SPI_CTRLA) USART mode with external clock */
#define   SERCOM_SPI_CTRLA_MODE_USART_INT_CLK    ( 0x1u << 2 ) /**< \brief (SERCOM_SPI_CTRLA) USART mode with internal clock */
#define   SERCOM_SPI_CTRLA_MODE_SPI_SLAVE        ( 0x2u << 2 ) /**< \brief (SERCOM_SPI_CTRLA) SPI mode with external clock */
#define   SERCOM_SPI_CTRLA_MODE_SPI_MASTER       ( 0x3u << 2 ) /**< \brief (SERCOM_SPI_CTRLA) SPI mode with internal clock */
#define   SERCOM_SPI_CTRLA_MODE_I2C_SLAVE        ( 0x4u << 2 ) /**< \brief (SERCOM_SPI_CTRLA) I2C mode with external clock */
#define   SERCOM_SPI_CTRLA_MODE_I2C_MASTER       ( 0x5u << 2 ) /**< \brief (SERCOM_SPI_CTRLA) I2C mode with internal clock */
#define SERCOM_SPI_CTRLA_RUNSTDBY_Pos            7             /**< \brief (SERCOM_SPI_CTRLA) Run during Standby */
#define SERCOM_SPI_CTRLA_RUNSTDBY                ( 0x1u << SERCOM_SPI_CTRLA_RUNSTDBY_Pos )
#define SERCOM_SPI_CTRLA_DOPO_Pos                16            /**< \brief (SERCOM_SPI_CTRLA) Data Out Pinout */
#define SERCOM_SPI_CTRLA_DOPO                    ( 0x1u << SERCOM_SPI_CTRLA_DOPO_Pos )
#define SERCOM_SPI_CTRLA_DIPO_Pos                20            /**< \brief (SERCOM_SPI_CTRLA) Data In Pinout */
#define SERCOM_SPI_CTRLA_DIPO_Msk                ( 0x3u << SERCOM_SPI_CTRLA_DIPO_Pos )
#define SERCOM_SPI_CTRLA_DIPO( value )    ( ( SERCOM_SPI_CTRLA_DIPO_Msk & ( ( value ) << SERCOM_SPI_CTRLA_DIPO_Pos ) ) )
#define SERCOM_SPI_CTRLA_FORM_Pos                24 /**< \brief (SERCOM_SPI_CTRLA) Frame Format */
#define SERCOM_SPI_CTRLA_FORM_Msk                ( 0xFu << SERCOM_SPI_CTRLA_FORM_Pos )
#define SERCOM_SPI_CTRLA_FORM( value )    ( ( SERCOM_SPI_CTRLA_FORM_Msk & ( ( value ) << SERCOM_SPI_CTRLA_FORM_Pos ) ) )
#define SERCOM_SPI_CTRLA_CPHA_Pos                28          /**< \brief (SERCOM_SPI_CTRLA) Clock Phase */
#define SERCOM_SPI_CTRLA_CPHA                    ( 0x1u << SERCOM_SPI_CTRLA_CPHA_Pos )
#define SERCOM_SPI_CTRLA_CPOL_Pos                29          /**< \brief (SERCOM_SPI_CTRLA) Clock Polarity */
#define SERCOM_SPI_CTRLA_CPOL                    ( 0x1u << SERCOM_SPI_CTRLA_CPOL_Pos )
#define SERCOM_SPI_CTRLA_DORD_Pos                30          /**< \brief (SERCOM_SPI_CTRLA) Data Order */
#define SERCOM_SPI_CTRLA_DORD                    ( 0x1u << SERCOM_SPI_CTRLA_DORD_Pos )
#define SERCOM_SPI_CTRLA_MASK                    0x7F31009Fu /**< \brief (SERCOM_SPI_CTRLA) MASK Register */

/* -------- SERCOM_USART_CTRLA : (SERCOM Offset: 0x00) (R/W 32) USART USART Control Register A -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t SWRST : 1;    /*!< bit:      0  Software Reset                     */
            uint32_t ENABLE : 1;   /*!< bit:      1  Enable                             */
            uint32_t MODE : 3;     /*!< bit:  2.. 4  Operating Mode                     */
            uint32_t : 2;          /*!< bit:  5.. 6  Reserved                           */
            uint32_t RUNSTDBY : 1; /*!< bit:      7  Run during Standby                 */
            uint32_t : 8;          /*!< bit:  8..15  Reserved                           */
            uint32_t TXPO : 1;     /*!< bit:     16  Transmit Data Pinout               */
            uint32_t : 3;          /*!< bit: 17..19  Reserved                           */
            uint32_t RXPO : 2;     /*!< bit: 20..21  Receive Data Pinout                */
            uint32_t : 2;          /*!< bit: 22..23  Reserved                           */
            uint32_t FORM : 4;     /*!< bit: 24..27  Frame Format                       */
            uint32_t CMODE : 1;    /*!< bit:     28  Communication Mode                 */
            uint32_t CPOL : 1;     /*!< bit:     29  Clock Polarity                     */
            uint32_t DORD : 1;     /*!< bit:     30  Data Order                         */
            uint32_t : 1;          /*!< bit:     31  Reserved                           */
        } bit;                     /*!< Structure used for bit  access                  */
        uint32_t reg;              /*!< Type      used for register access              */
    } SERCOM_USART_CTRLA_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SERCOM_USART_CTRLA_OFFSET                  0x00       /**< \brief (SERCOM_USART_CTRLA offset) USART Control Register A */
#define SERCOM_USART_CTRLA_RESETVALUE              0x00000000 /**< \brief (SERCOM_USART_CTRLA reset_value) USART Control Register A */

#define SERCOM_USART_CTRLA_SWRST_Pos               0          /**< \brief (SERCOM_USART_CTRLA) Software Reset */
#define SERCOM_USART_CTRLA_SWRST                   ( 0x1u << SERCOM_USART_CTRLA_SWRST_Pos )
#define SERCOM_USART_CTRLA_ENABLE_Pos              1          /**< \brief (SERCOM_USART_CTRLA) Enable */
#define SERCOM_USART_CTRLA_ENABLE                  ( 0x1u << SERCOM_USART_CTRLA_ENABLE_Pos )
#define SERCOM_USART_CTRLA_MODE_Pos                2          /**< \brief (SERCOM_USART_CTRLA) Operating Mode */
#define SERCOM_USART_CTRLA_MODE_Msk                ( 0x7u << SERCOM_USART_CTRLA_MODE_Pos )
#define SERCOM_USART_CTRLA_MODE( value )    ( ( SERCOM_USART_CTRLA_MODE_Msk & ( ( value ) << SERCOM_USART_CTRLA_MODE_Pos ) ) )
#define   SERCOM_USART_CTRLA_MODE_USART_EXT_CLK    ( 0x0u << 2 ) /**< \brief (SERCOM_USART_CTRLA) USART mode with external clock */
#define   SERCOM_USART_CTRLA_MODE_USART_INT_CLK    ( 0x1u << 2 ) /**< \brief (SERCOM_USART_CTRLA) USART mode with internal clock */
#define   SERCOM_USART_CTRLA_MODE_SPI_SLAVE        ( 0x2u << 2 ) /**< \brief (SERCOM_USART_CTRLA) SPI mode with external clock */
#define   SERCOM_USART_CTRLA_MODE_SPI_MASTER       ( 0x3u << 2 ) /**< \brief (SERCOM_USART_CTRLA) SPI mode with internal clock */
#define   SERCOM_USART_CTRLA_MODE_I2C_SLAVE        ( 0x4u << 2 ) /**< \brief (SERCOM_USART_CTRLA) I2C mode with external clock */
#define   SERCOM_USART_CTRLA_MODE_I2C_MASTER       ( 0x5u << 2 ) /**< \brief (SERCOM_USART_CTRLA) I2C mode with internal clock */
#define SERCOM_USART_CTRLA_RUNSTDBY_Pos            7             /**< \brief (SERCOM_USART_CTRLA) Run during Standby */
#define SERCOM_USART_CTRLA_RUNSTDBY                ( 0x1u << SERCOM_USART_CTRLA_RUNSTDBY_Pos )
#define SERCOM_USART_CTRLA_TXPO_Pos                16            /**< \brief (SERCOM_USART_CTRLA) Transmit Data Pinout */
#define SERCOM_USART_CTRLA_TXPO                    ( 0x1u << SERCOM_USART_CTRLA_TXPO_Pos )
#define SERCOM_USART_CTRLA_RXPO_Pos                20            /**< \brief (SERCOM_USART_CTRLA) Receive Data Pinout */
#define SERCOM_USART_CTRLA_RXPO_Msk                ( 0x3u << SERCOM_USART_CTRLA_RXPO_Pos )
#define SERCOM_USART_CTRLA_RXPO( value )    ( ( SERCOM_USART_CTRLA_RXPO_Msk & ( ( value ) << SERCOM_USART_CTRLA_RXPO_Pos ) ) )
#define SERCOM_USART_CTRLA_FORM_Pos                24 /**< \brief (SERCOM_USART_CTRLA) Frame Format */
#define SERCOM_USART_CTRLA_FORM_Msk                ( 0xFu << SERCOM_USART_CTRLA_FORM_Pos )
#define SERCOM_USART_CTRLA_FORM( value )    ( ( SERCOM_USART_CTRLA_FORM_Msk & ( ( value ) << SERCOM_USART_CTRLA_FORM_Pos ) ) )
#define SERCOM_USART_CTRLA_CMODE_Pos               28          /**< \brief (SERCOM_USART_CTRLA) Communication Mode */
#define SERCOM_USART_CTRLA_CMODE                   ( 0x1u << SERCOM_USART_CTRLA_CMODE_Pos )
#define SERCOM_USART_CTRLA_CPOL_Pos                29          /**< \brief (SERCOM_USART_CTRLA) Clock Polarity */
#define SERCOM_USART_CTRLA_CPOL                    ( 0x1u << SERCOM_USART_CTRLA_CPOL_Pos )
#define SERCOM_USART_CTRLA_DORD_Pos                30          /**< \brief (SERCOM_USART_CTRLA) Data Order */
#define SERCOM_USART_CTRLA_DORD                    ( 0x1u << SERCOM_USART_CTRLA_DORD_Pos )
#define SERCOM_USART_CTRLA_MASK                    0x7F31009Fu /**< \brief (SERCOM_USART_CTRLA) MASK Register */

