FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/component/component_sercom.h
/* -------- SERCOM_I2CM_CTRLB : (SERCOM Offset: 0x04) (R/W 32) I2CM I2CM Control Register B -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t : 8;        /*!< bit:  0.. 7  Reserved                           */
            uint32_t SMEN : 1;   /*!< bit:      8  Smart Mode Enable                  */
            uint32_t QCEN : 1;   /*!< bit:      9  Quick Command Enable               */
            uint32_t : 6;        /*!< bit: 10..15  Reserved                           */
            uint32_t CMD : 2;    /*!< bit: 16..17  Command                            */
            uint32_t ACKACT : 1; /*!< bit:     18  Acknowledge Action                 */
            uint32_t : 13;       /*!< bit: 19..31  Reserved                           */
        } bit;                   /*!< Structure used for bit  access                  */
        uint32_t reg;            /*!< Type      used for register access              */
    } SERCOM_I2CM_CTRLB_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SERCOM_I2CM_CTRLB_OFFSET        0x04       /**< \brief (SERCOM_I2CM_CTRLB offset) I2CM Control Register B */
#define SERCOM_I2CM_CTRLB_RESETVALUE    0x00000000 /**< \brief (SERCOM_I2CM_CTRLB reset_value) I2CM Control Register B */

#define SERCOM_I2CM_CTRLB_SMEN_Pos      8          /**< \brief (SERCOM_I2CM_CTRLB) Smart Mode Enable */
#define SERCOM_I2CM_CTRLB_SMEN          ( 0x1u << SERCOM_I2CM_CTRLB_SMEN_Pos )
#define SERCOM_I2CM_CTRLB_QCEN_Pos      9          /**< \brief (SERCOM_I2CM_CTRLB) Quick Command Enable */
#define SERCOM_I2CM_CTRLB_QCEN          ( 0x1u << SERCOM_I2CM_CTRLB_QCEN_Pos )
#define SERCOM_I2CM_CTRLB_CMD_Pos       16         /**< \brief (SERCOM_I2CM_CTRLB) Command */
#define SERCOM_I2CM_CTRLB_CMD_Msk       ( 0x3u << SERCOM_I2CM_CTRLB_CMD_Pos )
#define SERCOM_I2CM_CTRLB_CMD( value )    ( ( SERCOM_I2CM_CTRLB_CMD_Msk & ( ( value ) << SERCOM_I2CM_CTRLB_CMD_Pos ) ) )
#define SERCOM_I2CM_CTRLB_ACKACT_Pos    18          /**< \brief (SERCOM_I2CM_CTRLB) Acknowledge Action */
#define SERCOM_I2CM_CTRLB_ACKACT        ( 0x1u << SERCOM_I2CM_CTRLB_ACKACT_Pos )
#define SERCOM_I2CM_CTRLB_MASK          0x00070300u /**< \brief (SERCOM_I2CM_CTRLB) MASK Register */

/* -------- SERCOM_I2CS_CTRLB : (SERCOM Offset: 0x04) (R/W 32) I2CS I2CS Control Register B -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t : 8;        /*!< bit:  0.. 7  Reserved                           */
            uint32_t SMEN : 1;   /*!< bit:      8  Smart Mode Enable                  */
            uint32_t : 5;        /*!< bit:  9..13  Reserved                           */
            uint32_t AMODE : 2;  /*!< bit: 14..15  Address Mode                       */
            uint32_t CMD : 2;    /*!< bit: 16..17  Command                            */
            uint32_t ACKACT : 1; /*!< bit:     18  Acknowledge Action                 */
            uint32_t : 13;       /*!< bit: 19..31  Reserved                           */
        } bit;                   /*!< Structure used for bit  access                  */
        uint32_t reg;            /*!< Type      used for register access              */
    } SERCOM_I2CS_CTRLB_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SERCOM_I2CS_CTRLB_OFFSET        0x04       /**< \brief (SERCOM_I2CS_CTRLB offset) I2CS Control Register B */
#define SERCOM_I2CS_CTRLB_RESETVALUE    0x00000000 /**< \brief (SERCOM_I2CS_CTRLB reset_value) I2CS Control Register B */

#define SERCOM_I2CS_CTRLB_SMEN_Pos      8          /**< \brief (SERCOM_I2CS_CTRLB) Smart Mode Enable */
#define SERCOM_I2CS_CTRLB_SMEN          ( 0x1u << SERCOM_I2CS_CTRLB_SMEN_Pos )
#define SERCOM_I2CS_CTRLB_AMODE_Pos     14         /**< \brief (SERCOM_I2CS_CTRLB) Address Mode */
#define SERCOM_I2CS_CTRLB_AMODE_Msk     ( 0x3u << SERCOM_I2CS_CTRLB_AMODE_Pos )
#define SERCOM_I2CS_CTRLB_AMODE( value )    ( ( SERCOM_I2CS_CTRLB_AMODE_Msk & ( ( value ) << SERCOM_I2CS_CTRLB_AMODE_Pos ) ) )
#define SERCOM_I2CS_CTRLB_CMD_Pos       16       /**< \brief (SERCOM_I2CS_CTRLB) Command */
#define SERCOM_I2CS_CTRLB_CMD_Msk       ( 0x3u << SERCOM_I2CS_CTRLB_CMD_Pos )
#define SERCOM_I2CS_CTRLB_CMD( value )      ( ( SERCOM_I2CS_CTRLB_CMD_Msk & ( ( value ) << SERCOM_I2CS_CTRLB_CMD_Pos ) ) )
#define SERCOM_I2CS_CTRLB_ACKACT_Pos    18          /**< \brief (SERCOM_I2CS_CTRLB) Acknowledge Action */
#define SERCOM_I2CS_CTRLB_ACKACT        ( 0x1u << SERCOM_I2CS_CTRLB_ACKACT_Pos )
#define SERCOM_I2CS_CTRLB_MASK          0x0007C100u /**< \brief (SERCOM_I2CS_CTRLB) MASK Register */

/* -------- SERCOM_SPI_CTRLB : (SERCOM Offset: 0x04) (R/W 32) SPI SPI Control Register B -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t CHSIZE : 3;  /*!< bit:  0.. 2  Character Size                     */
            uint32_t : 3;         /*!< bit:  3.. 5  Reserved                           */
            uint32_t PLOADEN : 1; /*!< bit:      6  Data Preload Enable                */
            uint32_t : 7;         /*!< bit:  7..13  Reserved                           */
            uint32_t AMODE : 2;   /*!< bit: 14..15  Address Mode                       */
            uint32_t : 1;         /*!< bit:     16  Reserved                           */
            uint32_t RXEN : 1;    /*!< bit:     17  Receiver Enable                    */
            uint32_t : 14;        /*!< bit: 18..31  Reserved                           */
        } bit;                    /*!< Structure used for bit  access                  */
        uint32_t reg;             /*!< Type      used for register access              */
    } SERCOM_SPI_CTRLB_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SERCOM_SPI_CTRLB_OFFSET         0x04       /**< \brief (SERCOM_SPI_CTRLB offset) SPI Control Register B */
#define SERCOM_SPI_CTRLB_RESETVALUE     0x00000000 /**< \brief (SERCOM_SPI_CTRLB reset_value) SPI Control Register B */

