FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/component/component_sercom.h
#define SERCOM_SPI_CTRLB_CHSIZE_Pos     0          /**< \brief (SERCOM_SPI_CTRLB) Character Size */
#define SERCOM_SPI_CTRLB_CHSIZE_Msk     ( 0x7u << SERCOM_SPI_CTRLB_CHSIZE_Pos )
#define SERCOM_SPI_CTRLB_CHSIZE( value )    ( ( SERCOM_SPI_CTRLB_CHSIZE_Msk & ( ( value ) << SERCOM_SPI_CTRLB_CHSIZE_Pos ) ) )
#define SERCOM_SPI_CTRLB_PLOADEN_Pos    6        /**< \brief (SERCOM_SPI_CTRLB) Data Preload Enable */
#define SERCOM_SPI_CTRLB_PLOADEN        ( 0x1u << SERCOM_SPI_CTRLB_PLOADEN_Pos )
#define SERCOM_SPI_CTRLB_AMODE_Pos      14       /**< \brief (SERCOM_SPI_CTRLB) Address Mode */
#define SERCOM_SPI_CTRLB_AMODE_Msk      ( 0x3u << SERCOM_SPI_CTRLB_AMODE_Pos )
#define SERCOM_SPI_CTRLB_AMODE( value )    ( ( SERCOM_SPI_CTRLB_AMODE_Msk & ( ( value ) << SERCOM_SPI_CTRLB_AMODE_Pos ) ) )
#define SERCOM_SPI_CTRLB_RXEN_Pos       17          /**< \brief (SERCOM_SPI_CTRLB) Receiver Enable */
#define SERCOM_SPI_CTRLB_RXEN           ( 0x1u << SERCOM_SPI_CTRLB_RXEN_Pos )
#define SERCOM_SPI_CTRLB_MASK           0x0002C047u /**< \brief (SERCOM_SPI_CTRLB) MASK Register */

/* -------- SERCOM_USART_CTRLB : (SERCOM Offset: 0x04) (R/W 32) USART USART Control Register B -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t CHSIZE : 3; /*!< bit:  0.. 2  Character Size                     */
            uint32_t : 3;        /*!< bit:  3.. 5  Reserved                           */
            uint32_t SBMODE : 1; /*!< bit:      6  Stop Bit Mode                      */
            uint32_t : 2;        /*!< bit:  7.. 8  Reserved                           */
            uint32_t SFDE : 1;   /*!< bit:      9  Start of Frame Detection Enable    */
            uint32_t : 3;        /*!< bit: 10..12  Reserved                           */
            uint32_t PMODE : 1;  /*!< bit:     13  Parity Mode                        */
            uint32_t : 2;        /*!< bit: 14..15  Reserved                           */
            uint32_t TXEN : 1;   /*!< bit:     16  Transmitter Enable                 */
            uint32_t RXEN : 1;   /*!< bit:     17  Receiver Enable                    */
            uint32_t : 14;       /*!< bit: 18..31  Reserved                           */
        } bit;                   /*!< Structure used for bit  access                  */
        uint32_t reg;            /*!< Type      used for register access              */
    } SERCOM_USART_CTRLB_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SERCOM_USART_CTRLB_OFFSET        0x04       /**< \brief (SERCOM_USART_CTRLB offset) USART Control Register B */
#define SERCOM_USART_CTRLB_RESETVALUE    0x00000000 /**< \brief (SERCOM_USART_CTRLB reset_value) USART Control Register B */

#define SERCOM_USART_CTRLB_CHSIZE_Pos    0          /**< \brief (SERCOM_USART_CTRLB) Character Size */
#define SERCOM_USART_CTRLB_CHSIZE_Msk    ( 0x7u << SERCOM_USART_CTRLB_CHSIZE_Pos )
#define SERCOM_USART_CTRLB_CHSIZE( value )    ( ( SERCOM_USART_CTRLB_CHSIZE_Msk & ( ( value ) << SERCOM_USART_CTRLB_CHSIZE_Pos ) ) )
#define SERCOM_USART_CTRLB_SBMODE_Pos    6           /**< \brief (SERCOM_USART_CTRLB) Stop Bit Mode */
#define SERCOM_USART_CTRLB_SBMODE        ( 0x1u << SERCOM_USART_CTRLB_SBMODE_Pos )
#define SERCOM_USART_CTRLB_SFDE_Pos      9           /**< \brief (SERCOM_USART_CTRLB) Start of Frame Detection Enable */
#define SERCOM_USART_CTRLB_SFDE          ( 0x1u << SERCOM_USART_CTRLB_SFDE_Pos )
#define SERCOM_USART_CTRLB_PMODE_Pos     13          /**< \brief (SERCOM_USART_CTRLB) Parity Mode */
#define SERCOM_USART_CTRLB_PMODE         ( 0x1u << SERCOM_USART_CTRLB_PMODE_Pos )
#define SERCOM_USART_CTRLB_TXEN_Pos      16          /**< \brief (SERCOM_USART_CTRLB) Transmitter Enable */
#define SERCOM_USART_CTRLB_TXEN          ( 0x1u << SERCOM_USART_CTRLB_TXEN_Pos )
#define SERCOM_USART_CTRLB_RXEN_Pos      17          /**< \brief (SERCOM_USART_CTRLB) Receiver Enable */
#define SERCOM_USART_CTRLB_RXEN          ( 0x1u << SERCOM_USART_CTRLB_RXEN_Pos )
#define SERCOM_USART_CTRLB_MASK          0x00032247u /**< \brief (SERCOM_USART_CTRLB) MASK Register */

/* -------- SERCOM_I2CM_DBGCTRL : (SERCOM Offset: 0x08) (R/W  8) I2CM I2CM Debug Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t DBGSTOP : 1; /*!< bit:      0  Debug Mode                         */
            uint8_t  : 7;        /*!< bit:  1.. 7  Reserved                           */
        } bit;                   /*!< Structure used for bit  access                  */
        uint8_t reg;             /*!< Type      used for register access              */
    } SERCOM_I2CM_DBGCTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SERCOM_I2CM_DBGCTRL_OFFSET         0x08  /**< \brief (SERCOM_I2CM_DBGCTRL offset) I2CM Debug Register */
#define SERCOM_I2CM_DBGCTRL_RESETVALUE     0x00  /**< \brief (SERCOM_I2CM_DBGCTRL reset_value) I2CM Debug Register */

#define SERCOM_I2CM_DBGCTRL_DBGSTOP_Pos    0     /**< \brief (SERCOM_I2CM_DBGCTRL) Debug Mode */
#define SERCOM_I2CM_DBGCTRL_DBGSTOP        ( 0x1u << SERCOM_I2CM_DBGCTRL_DBGSTOP_Pos )
#define SERCOM_I2CM_DBGCTRL_MASK           0x01u /**< \brief (SERCOM_I2CM_DBGCTRL) MASK Register */

/* -------- SERCOM_SPI_DBGCTRL : (SERCOM Offset: 0x08) (R/W  8) SPI SPI Debug Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t DBGSTOP : 1; /*!< bit:      0  Debug Mode                         */
            uint8_t  : 7;        /*!< bit:  1.. 7  Reserved                           */
        } bit;                   /*!< Structure used for bit  access                  */
        uint8_t reg;             /*!< Type      used for register access              */
    } SERCOM_SPI_DBGCTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SERCOM_SPI_DBGCTRL_OFFSET         0x08   /**< \brief (SERCOM_SPI_DBGCTRL offset) SPI Debug Register */
#define SERCOM_SPI_DBGCTRL_RESETVALUE     0x00   /**< \brief (SERCOM_SPI_DBGCTRL reset_value) SPI Debug Register */

#define SERCOM_SPI_DBGCTRL_DBGSTOP_Pos    0      /**< \brief (SERCOM_SPI_DBGCTRL) Debug Mode */
#define SERCOM_SPI_DBGCTRL_DBGSTOP        ( 0x1u << SERCOM_SPI_DBGCTRL_DBGSTOP_Pos )
#define SERCOM_SPI_DBGCTRL_MASK           0x01u  /**< \brief (SERCOM_SPI_DBGCTRL) MASK Register */

/* -------- SERCOM_USART_DBGCTRL : (SERCOM Offset: 0x08) (R/W  8) USART USART Debug Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t DBGSTOP : 1; /*!< bit:      0  Debug Mode                         */
            uint8_t  : 7;        /*!< bit:  1.. 7  Reserved                           */
        } bit;                   /*!< Structure used for bit  access                  */
        uint8_t reg;             /*!< Type      used for register access              */
    } SERCOM_USART_DBGCTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SERCOM_USART_DBGCTRL_OFFSET         0x08  /**< \brief (SERCOM_USART_DBGCTRL offset) USART Debug Register */
#define SERCOM_USART_DBGCTRL_RESETVALUE     0x00  /**< \brief (SERCOM_USART_DBGCTRL reset_value) USART Debug Register */

#define SERCOM_USART_DBGCTRL_DBGSTOP_Pos    0     /**< \brief (SERCOM_USART_DBGCTRL) Debug Mode */
#define SERCOM_USART_DBGCTRL_DBGSTOP        ( 0x1u << SERCOM_USART_DBGCTRL_DBGSTOP_Pos )
#define SERCOM_USART_DBGCTRL_MASK           0x01u /**< \brief (SERCOM_USART_DBGCTRL) MASK Register */

