FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/component/component_sercom.h
/* -------- SERCOM_I2CM_BAUD : (SERCOM Offset: 0x0A) (R/W 16) I2CM I2CM Baud Rate Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint16_t BAUD : 8;    /*!< bit:  0.. 7  Baud Rate Value                    */
            uint16_t BAUDLOW : 8; /*!< bit:  8..15  Baud Rate Value Low                */
        } bit;                    /*!< Structure used for bit  access                  */
        uint16_t reg;             /*!< Type      used for register access              */
    } SERCOM_I2CM_BAUD_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SERCOM_I2CM_BAUD_OFFSET         0x0A     /**< \brief (SERCOM_I2CM_BAUD offset) I2CM Baud Rate Register */
#define SERCOM_I2CM_BAUD_RESETVALUE     0x0000   /**< \brief (SERCOM_I2CM_BAUD reset_value) I2CM Baud Rate Register */

#define SERCOM_I2CM_BAUD_BAUD_Pos       0        /**< \brief (SERCOM_I2CM_BAUD) Baud Rate Value */
#define SERCOM_I2CM_BAUD_BAUD_Msk       ( 0xFFu << SERCOM_I2CM_BAUD_BAUD_Pos )
#define SERCOM_I2CM_BAUD_BAUD( value )       ( ( SERCOM_I2CM_BAUD_BAUD_Msk & ( ( value ) << SERCOM_I2CM_BAUD_BAUD_Pos ) ) )
#define SERCOM_I2CM_BAUD_BAUDLOW_Pos    8         /**< \brief (SERCOM_I2CM_BAUD) Baud Rate Value Low */
#define SERCOM_I2CM_BAUD_BAUDLOW_Msk    ( 0xFFu << SERCOM_I2CM_BAUD_BAUDLOW_Pos )
#define SERCOM_I2CM_BAUD_BAUDLOW( value )    ( ( SERCOM_I2CM_BAUD_BAUDLOW_Msk & ( ( value ) << SERCOM_I2CM_BAUD_BAUDLOW_Pos ) ) )
#define SERCOM_I2CM_BAUD_MASK           0xFFFFu  /**< \brief (SERCOM_I2CM_BAUD) MASK Register */

/* -------- SERCOM_SPI_BAUD : (SERCOM Offset: 0x0A) (R/W  8) SPI SPI Baud Rate Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t BAUD : 8;  /*!< bit:  0.. 7  Baud Rate Value                    */
        } bit;                 /*!< Structure used for bit  access                  */
        uint8_t reg;           /*!< Type      used for register access              */
    } SERCOM_SPI_BAUD_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SERCOM_SPI_BAUD_OFFSET        0x0A       /**< \brief (SERCOM_SPI_BAUD offset) SPI Baud Rate Register */
#define SERCOM_SPI_BAUD_RESETVALUE    0x00       /**< \brief (SERCOM_SPI_BAUD reset_value) SPI Baud Rate Register */

#define SERCOM_SPI_BAUD_BAUD_Pos      0          /**< \brief (SERCOM_SPI_BAUD) Baud Rate Value */
#define SERCOM_SPI_BAUD_BAUD_Msk      ( 0xFFu << SERCOM_SPI_BAUD_BAUD_Pos )
#define SERCOM_SPI_BAUD_BAUD( value )    ( ( SERCOM_SPI_BAUD_BAUD_Msk & ( ( value ) << SERCOM_SPI_BAUD_BAUD_Pos ) ) )
#define SERCOM_SPI_BAUD_MASK          0xFFu      /**< \brief (SERCOM_SPI_BAUD) MASK Register */

/* -------- SERCOM_USART_BAUD : (SERCOM Offset: 0x0A) (R/W 16) USART USART Baud Rate Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint16_t BAUD : 16; /*!< bit:  0..15  Baud Rate Value                    */
        } bit;                  /*!< Structure used for bit  access                  */
        uint16_t reg;           /*!< Type      used for register access              */
    } SERCOM_USART_BAUD_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SERCOM_USART_BAUD_OFFSET        0x0A     /**< \brief (SERCOM_USART_BAUD offset) USART Baud Rate Register */
#define SERCOM_USART_BAUD_RESETVALUE    0x0000   /**< \brief (SERCOM_USART_BAUD reset_value) USART Baud Rate Register */

#define SERCOM_USART_BAUD_BAUD_Pos      0        /**< \brief (SERCOM_USART_BAUD) Baud Rate Value */
#define SERCOM_USART_BAUD_BAUD_Msk      ( 0xFFFFu << SERCOM_USART_BAUD_BAUD_Pos )
#define SERCOM_USART_BAUD_BAUD( value )    ( ( SERCOM_USART_BAUD_BAUD_Msk & ( ( value ) << SERCOM_USART_BAUD_BAUD_Pos ) ) )
#define SERCOM_USART_BAUD_MASK          0xFFFFu  /**< \brief (SERCOM_USART_BAUD) MASK Register */

/* -------- SERCOM_I2CM_INTENCLR : (SERCOM Offset: 0x0C) (R/W  8) I2CM I2CM Interrupt Enable Clear Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t MB : 1;    /*!< bit:      0  Write Interrupt Disable            */
            uint8_t SB : 1;    /*!< bit:      1  Read Interrupt Disable             */
            uint8_t  : 6;      /*!< bit:  2.. 7  Reserved                           */
        } bit;                 /*!< Structure used for bit  access                  */
        uint8_t reg;           /*!< Type      used for register access              */
    } SERCOM_I2CM_INTENCLR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SERCOM_I2CM_INTENCLR_OFFSET        0x0C  /**< \brief (SERCOM_I2CM_INTENCLR offset) I2CM Interrupt Enable Clear Register */
#define SERCOM_I2CM_INTENCLR_RESETVALUE    0x00  /**< \brief (SERCOM_I2CM_INTENCLR reset_value) I2CM Interrupt Enable Clear Register */

#define SERCOM_I2CM_INTENCLR_MB_Pos        0     /**< \brief (SERCOM_I2CM_INTENCLR) Write Interrupt Disable */
#define SERCOM_I2CM_INTENCLR_MB            ( 0x1u << SERCOM_I2CM_INTENCLR_MB_Pos )
#define SERCOM_I2CM_INTENCLR_SB_Pos        1     /**< \brief (SERCOM_I2CM_INTENCLR) Read Interrupt Disable */
#define SERCOM_I2CM_INTENCLR_SB            ( 0x1u << SERCOM_I2CM_INTENCLR_SB_Pos )
#define SERCOM_I2CM_INTENCLR_MASK          0x03u /**< \brief (SERCOM_I2CM_INTENCLR) MASK Register */

/* -------- SERCOM_I2CS_INTENCLR : (SERCOM Offset: 0x0C) (R/W  8) I2CS I2CS Interrupt Enable Clear Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t PREC : 1;   /*!< bit:      0  Stop Interrupt Disable             */
            uint8_t AMATCH : 1; /*!< bit:      1  Address Interrupt Disable          */
            uint8_t DRDY : 1;   /*!< bit:      2  Data Interrupt Disable             */
            uint8_t  : 5;       /*!< bit:  3.. 7  Reserved                           */
        } bit;                  /*!< Structure used for bit  access                  */
        uint8_t reg;            /*!< Type      used for register access              */
    } SERCOM_I2CS_INTENCLR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

