FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/component/component_sercom.h
#define SERCOM_I2CS_INTENCLR_OFFSET        0x0C  /**< \brief (SERCOM_I2CS_INTENCLR offset) I2CS Interrupt Enable Clear Register */
#define SERCOM_I2CS_INTENCLR_RESETVALUE    0x00  /**< \brief (SERCOM_I2CS_INTENCLR reset_value) I2CS Interrupt Enable Clear Register */

#define SERCOM_I2CS_INTENCLR_PREC_Pos      0     /**< \brief (SERCOM_I2CS_INTENCLR) Stop Interrupt Disable */
#define SERCOM_I2CS_INTENCLR_PREC          ( 0x1u << SERCOM_I2CS_INTENCLR_PREC_Pos )
#define SERCOM_I2CS_INTENCLR_AMATCH_Pos    1     /**< \brief (SERCOM_I2CS_INTENCLR) Address Interrupt Disable */
#define SERCOM_I2CS_INTENCLR_AMATCH        ( 0x1u << SERCOM_I2CS_INTENCLR_AMATCH_Pos )
#define SERCOM_I2CS_INTENCLR_DRDY_Pos      2     /**< \brief (SERCOM_I2CS_INTENCLR) Data Interrupt Disable */
#define SERCOM_I2CS_INTENCLR_DRDY          ( 0x1u << SERCOM_I2CS_INTENCLR_DRDY_Pos )
#define SERCOM_I2CS_INTENCLR_MASK          0x07u /**< \brief (SERCOM_I2CS_INTENCLR) MASK Register */

/* -------- SERCOM_SPI_INTENCLR : (SERCOM Offset: 0x0C) (R/W  8) SPI SPI Interrupt Enable Clear Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t DRE : 1;   /*!< bit:      0  Data Register Empty Interrupt Disable */
            uint8_t TXC : 1;   /*!< bit:      1  Transmit Complete Interrupt Disable */
            uint8_t RXC : 1;   /*!< bit:      2  Receive Complete Interrupt Disable */
            uint8_t  : 5;      /*!< bit:  3.. 7  Reserved                           */
        } bit;                 /*!< Structure used for bit  access                  */
        uint8_t reg;           /*!< Type      used for register access              */
    } SERCOM_SPI_INTENCLR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SERCOM_SPI_INTENCLR_OFFSET        0x0C   /**< \brief (SERCOM_SPI_INTENCLR offset) SPI Interrupt Enable Clear Register */
#define SERCOM_SPI_INTENCLR_RESETVALUE    0x00   /**< \brief (SERCOM_SPI_INTENCLR reset_value) SPI Interrupt Enable Clear Register */

#define SERCOM_SPI_INTENCLR_DRE_Pos       0      /**< \brief (SERCOM_SPI_INTENCLR) Data Register Empty Interrupt Disable */
#define SERCOM_SPI_INTENCLR_DRE           ( 0x1u << SERCOM_SPI_INTENCLR_DRE_Pos )
#define SERCOM_SPI_INTENCLR_TXC_Pos       1      /**< \brief (SERCOM_SPI_INTENCLR) Transmit Complete Interrupt Disable */
#define SERCOM_SPI_INTENCLR_TXC           ( 0x1u << SERCOM_SPI_INTENCLR_TXC_Pos )
#define SERCOM_SPI_INTENCLR_RXC_Pos       2      /**< \brief (SERCOM_SPI_INTENCLR) Receive Complete Interrupt Disable */
#define SERCOM_SPI_INTENCLR_RXC           ( 0x1u << SERCOM_SPI_INTENCLR_RXC_Pos )
#define SERCOM_SPI_INTENCLR_MASK          0x07u  /**< \brief (SERCOM_SPI_INTENCLR) MASK Register */

/* -------- SERCOM_USART_INTENCLR : (SERCOM Offset: 0x0C) (R/W  8) USART USART Interrupt Enable Clear Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t DRE : 1;   /*!< bit:      0  Data Register Empty Interrupt Disable */
            uint8_t TXC : 1;   /*!< bit:      1  Transmit Complete Interrupt Disable */
            uint8_t RXC : 1;   /*!< bit:      2  Receive Complete Interrupt Disable */
            uint8_t RXS : 1;   /*!< bit:      3  Receive Start Interrupt Disable    */
            uint8_t  : 4;      /*!< bit:  4.. 7  Reserved                           */
        } bit;                 /*!< Structure used for bit  access                  */
        uint8_t reg;           /*!< Type      used for register access              */
    } SERCOM_USART_INTENCLR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SERCOM_USART_INTENCLR_OFFSET        0x0C  /**< \brief (SERCOM_USART_INTENCLR offset) USART Interrupt Enable Clear Register */
#define SERCOM_USART_INTENCLR_RESETVALUE    0x00  /**< \brief (SERCOM_USART_INTENCLR reset_value) USART Interrupt Enable Clear Register */

#define SERCOM_USART_INTENCLR_DRE_Pos       0     /**< \brief (SERCOM_USART_INTENCLR) Data Register Empty Interrupt Disable */
#define SERCOM_USART_INTENCLR_DRE           ( 0x1u << SERCOM_USART_INTENCLR_DRE_Pos )
#define SERCOM_USART_INTENCLR_TXC_Pos       1     /**< \brief (SERCOM_USART_INTENCLR) Transmit Complete Interrupt Disable */
#define SERCOM_USART_INTENCLR_TXC           ( 0x1u << SERCOM_USART_INTENCLR_TXC_Pos )
#define SERCOM_USART_INTENCLR_RXC_Pos       2     /**< \brief (SERCOM_USART_INTENCLR) Receive Complete Interrupt Disable */
#define SERCOM_USART_INTENCLR_RXC           ( 0x1u << SERCOM_USART_INTENCLR_RXC_Pos )
#define SERCOM_USART_INTENCLR_RXS_Pos       3     /**< \brief (SERCOM_USART_INTENCLR) Receive Start Interrupt Disable */
#define SERCOM_USART_INTENCLR_RXS           ( 0x1u << SERCOM_USART_INTENCLR_RXS_Pos )
#define SERCOM_USART_INTENCLR_MASK          0x0Fu /**< \brief (SERCOM_USART_INTENCLR) MASK Register */

/* -------- SERCOM_I2CM_INTENSET : (SERCOM Offset: 0x0D) (R/W  8) I2CM I2CM Interrupt Enable Set Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t MB : 1;    /*!< bit:      0  Write Interrupt Enable             */
            uint8_t SB : 1;    /*!< bit:      1  Read Interrupt Enable              */
            uint8_t  : 6;      /*!< bit:  2.. 7  Reserved                           */
        } bit;                 /*!< Structure used for bit  access                  */
        uint8_t reg;           /*!< Type      used for register access              */
    } SERCOM_I2CM_INTENSET_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SERCOM_I2CM_INTENSET_OFFSET        0x0D  /**< \brief (SERCOM_I2CM_INTENSET offset) I2CM Interrupt Enable Set Register */
#define SERCOM_I2CM_INTENSET_RESETVALUE    0x00  /**< \brief (SERCOM_I2CM_INTENSET reset_value) I2CM Interrupt Enable Set Register */

