FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/component/component_sercom.h
#define SERCOM_I2CM_INTENSET_MB_Pos        0     /**< \brief (SERCOM_I2CM_INTENSET) Write Interrupt Enable */
#define SERCOM_I2CM_INTENSET_MB            ( 0x1u << SERCOM_I2CM_INTENSET_MB_Pos )
#define SERCOM_I2CM_INTENSET_SB_Pos        1     /**< \brief (SERCOM_I2CM_INTENSET) Read Interrupt Enable */
#define SERCOM_I2CM_INTENSET_SB            ( 0x1u << SERCOM_I2CM_INTENSET_SB_Pos )
#define SERCOM_I2CM_INTENSET_MASK          0x03u /**< \brief (SERCOM_I2CM_INTENSET) MASK Register */

/* -------- SERCOM_I2CS_INTENSET : (SERCOM Offset: 0x0D) (R/W  8) I2CS I2CS Interrupt Enable Set Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t PREC : 1;   /*!< bit:      0  Stop Interrupt Enable              */
            uint8_t AMATCH : 1; /*!< bit:      1  Address Interrupt Enable           */
            uint8_t DRDY : 1;   /*!< bit:      2  Data Interrupt Enable              */
            uint8_t  : 5;       /*!< bit:  3.. 7  Reserved                           */
        } bit;                  /*!< Structure used for bit  access                  */
        uint8_t reg;            /*!< Type      used for register access              */
    } SERCOM_I2CS_INTENSET_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SERCOM_I2CS_INTENSET_OFFSET        0x0D  /**< \brief (SERCOM_I2CS_INTENSET offset) I2CS Interrupt Enable Set Register */
#define SERCOM_I2CS_INTENSET_RESETVALUE    0x00  /**< \brief (SERCOM_I2CS_INTENSET reset_value) I2CS Interrupt Enable Set Register */

#define SERCOM_I2CS_INTENSET_PREC_Pos      0     /**< \brief (SERCOM_I2CS_INTENSET) Stop Interrupt Enable */
#define SERCOM_I2CS_INTENSET_PREC          ( 0x1u << SERCOM_I2CS_INTENSET_PREC_Pos )
#define SERCOM_I2CS_INTENSET_AMATCH_Pos    1     /**< \brief (SERCOM_I2CS_INTENSET) Address Interrupt Enable */
#define SERCOM_I2CS_INTENSET_AMATCH        ( 0x1u << SERCOM_I2CS_INTENSET_AMATCH_Pos )
#define SERCOM_I2CS_INTENSET_DRDY_Pos      2     /**< \brief (SERCOM_I2CS_INTENSET) Data Interrupt Enable */
#define SERCOM_I2CS_INTENSET_DRDY          ( 0x1u << SERCOM_I2CS_INTENSET_DRDY_Pos )
#define SERCOM_I2CS_INTENSET_MASK          0x07u /**< \brief (SERCOM_I2CS_INTENSET) MASK Register */

/* -------- SERCOM_SPI_INTENSET : (SERCOM Offset: 0x0D) (R/W  8) SPI SPI Interrupt Enable Set Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t DRE : 1;   /*!< bit:      0  Data Register Empty Interrupt Enable */
            uint8_t TXC : 1;   /*!< bit:      1  Transmit Complete Interrupt Enable */
            uint8_t RXC : 1;   /*!< bit:      2  Receive Complete Interrupt Enable  */
            uint8_t  : 5;      /*!< bit:  3.. 7  Reserved                           */
        } bit;                 /*!< Structure used for bit  access                  */
        uint8_t reg;           /*!< Type      used for register access              */
    } SERCOM_SPI_INTENSET_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SERCOM_SPI_INTENSET_OFFSET        0x0D   /**< \brief (SERCOM_SPI_INTENSET offset) SPI Interrupt Enable Set Register */
#define SERCOM_SPI_INTENSET_RESETVALUE    0x00   /**< \brief (SERCOM_SPI_INTENSET reset_value) SPI Interrupt Enable Set Register */

#define SERCOM_SPI_INTENSET_DRE_Pos       0      /**< \brief (SERCOM_SPI_INTENSET) Data Register Empty Interrupt Enable */
#define SERCOM_SPI_INTENSET_DRE           ( 0x1u << SERCOM_SPI_INTENSET_DRE_Pos )
#define SERCOM_SPI_INTENSET_TXC_Pos       1      /**< \brief (SERCOM_SPI_INTENSET) Transmit Complete Interrupt Enable */
#define SERCOM_SPI_INTENSET_TXC           ( 0x1u << SERCOM_SPI_INTENSET_TXC_Pos )
#define SERCOM_SPI_INTENSET_RXC_Pos       2      /**< \brief (SERCOM_SPI_INTENSET) Receive Complete Interrupt Enable */
#define SERCOM_SPI_INTENSET_RXC           ( 0x1u << SERCOM_SPI_INTENSET_RXC_Pos )
#define SERCOM_SPI_INTENSET_MASK          0x07u  /**< \brief (SERCOM_SPI_INTENSET) MASK Register */

/* -------- SERCOM_USART_INTENSET : (SERCOM Offset: 0x0D) (R/W  8) USART USART Interrupt Enable Set Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t DRE : 1;   /*!< bit:      0  Data Register Empty Interrupt Enable */
            uint8_t TXC : 1;   /*!< bit:      1  Transmit Complete Interrupt Enable */
            uint8_t RXC : 1;   /*!< bit:      2  Receive Complete Interrupt Enable  */
            uint8_t RXS : 1;   /*!< bit:      3  Receive Start Interrupt Enable     */
            uint8_t  : 4;      /*!< bit:  4.. 7  Reserved                           */
        } bit;                 /*!< Structure used for bit  access                  */
        uint8_t reg;           /*!< Type      used for register access              */
    } SERCOM_USART_INTENSET_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SERCOM_USART_INTENSET_OFFSET        0x0D  /**< \brief (SERCOM_USART_INTENSET offset) USART Interrupt Enable Set Register */
#define SERCOM_USART_INTENSET_RESETVALUE    0x00  /**< \brief (SERCOM_USART_INTENSET reset_value) USART Interrupt Enable Set Register */

#define SERCOM_USART_INTENSET_DRE_Pos       0     /**< \brief (SERCOM_USART_INTENSET) Data Register Empty Interrupt Enable */
#define SERCOM_USART_INTENSET_DRE           ( 0x1u << SERCOM_USART_INTENSET_DRE_Pos )
#define SERCOM_USART_INTENSET_TXC_Pos       1     /**< \brief (SERCOM_USART_INTENSET) Transmit Complete Interrupt Enable */
#define SERCOM_USART_INTENSET_TXC           ( 0x1u << SERCOM_USART_INTENSET_TXC_Pos )
#define SERCOM_USART_INTENSET_RXC_Pos       2     /**< \brief (SERCOM_USART_INTENSET) Receive Complete Interrupt Enable */
#define SERCOM_USART_INTENSET_RXC           ( 0x1u << SERCOM_USART_INTENSET_RXC_Pos )
#define SERCOM_USART_INTENSET_RXS_Pos       3     /**< \brief (SERCOM_USART_INTENSET) Receive Start Interrupt Enable */
#define SERCOM_USART_INTENSET_RXS           ( 0x1u << SERCOM_USART_INTENSET_RXS_Pos )
#define SERCOM_USART_INTENSET_MASK          0x0Fu /**< \brief (SERCOM_USART_INTENSET) MASK Register */

/* -------- SERCOM_I2CM_INTFLAG : (SERCOM Offset: 0x0E) (R/W  8) I2CM I2CM Interrupt Flag Status and Clear Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t MB : 1;    /*!< bit:      0  Write Interrupt                    */
            uint8_t SB : 1;    /*!< bit:      1  Read Interrupt                     */
            uint8_t  : 6;      /*!< bit:  2.. 7  Reserved                           */
        } bit;                 /*!< Structure used for bit  access                  */
        uint8_t reg;           /*!< Type      used for register access              */
    } SERCOM_I2CM_INTFLAG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SERCOM_I2CM_INTFLAG_OFFSET        0x0E   /**< \brief (SERCOM_I2CM_INTFLAG offset) I2CM Interrupt Flag Status and Clear Register */
#define SERCOM_I2CM_INTFLAG_RESETVALUE    0x00   /**< \brief (SERCOM_I2CM_INTFLAG reset_value) I2CM Interrupt Flag Status and Clear Register */

