FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/component/component_sercom.h
#define SERCOM_I2CM_INTFLAG_MB_Pos        0      /**< \brief (SERCOM_I2CM_INTFLAG) Write Interrupt */
#define SERCOM_I2CM_INTFLAG_MB            ( 0x1u << SERCOM_I2CM_INTFLAG_MB_Pos )
#define SERCOM_I2CM_INTFLAG_SB_Pos        1      /**< \brief (SERCOM_I2CM_INTFLAG) Read Interrupt */
#define SERCOM_I2CM_INTFLAG_SB            ( 0x1u << SERCOM_I2CM_INTFLAG_SB_Pos )
#define SERCOM_I2CM_INTFLAG_MASK          0x03u  /**< \brief (SERCOM_I2CM_INTFLAG) MASK Register */

/* -------- SERCOM_I2CS_INTFLAG : (SERCOM Offset: 0x0E) (R/W  8) I2CS I2CS Interrupt Flag Status and Clear Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t PREC : 1;   /*!< bit:      0  Stop Interrupt                     */
            uint8_t AMATCH : 1; /*!< bit:      1  Address Interrupt                  */
            uint8_t DRDY : 1;   /*!< bit:      2  Data Interrupt                     */
            uint8_t  : 5;       /*!< bit:  3.. 7  Reserved                           */
        } bit;                  /*!< Structure used for bit  access                  */
        uint8_t reg;            /*!< Type      used for register access              */
    } SERCOM_I2CS_INTFLAG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SERCOM_I2CS_INTFLAG_OFFSET        0x0E   /**< \brief (SERCOM_I2CS_INTFLAG offset) I2CS Interrupt Flag Status and Clear Register */
#define SERCOM_I2CS_INTFLAG_RESETVALUE    0x00   /**< \brief (SERCOM_I2CS_INTFLAG reset_value) I2CS Interrupt Flag Status and Clear Register */

#define SERCOM_I2CS_INTFLAG_PREC_Pos      0      /**< \brief (SERCOM_I2CS_INTFLAG) Stop Interrupt */
#define SERCOM_I2CS_INTFLAG_PREC          ( 0x1u << SERCOM_I2CS_INTFLAG_PREC_Pos )
#define SERCOM_I2CS_INTFLAG_AMATCH_Pos    1      /**< \brief (SERCOM_I2CS_INTFLAG) Address Interrupt */
#define SERCOM_I2CS_INTFLAG_AMATCH        ( 0x1u << SERCOM_I2CS_INTFLAG_AMATCH_Pos )
#define SERCOM_I2CS_INTFLAG_DRDY_Pos      2      /**< \brief (SERCOM_I2CS_INTFLAG) Data Interrupt */
#define SERCOM_I2CS_INTFLAG_DRDY          ( 0x1u << SERCOM_I2CS_INTFLAG_DRDY_Pos )
#define SERCOM_I2CS_INTFLAG_MASK          0x07u  /**< \brief (SERCOM_I2CS_INTFLAG) MASK Register */

/* -------- SERCOM_SPI_INTFLAG : (SERCOM Offset: 0x0E) (R/W  8) SPI SPI Interrupt Flag Status and Clear Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t DRE : 1;   /*!< bit:      0  Data Register Empty Interrupt      */
            uint8_t TXC : 1;   /*!< bit:      1  Transmit Complete Interrupt        */
            uint8_t RXC : 1;   /*!< bit:      2  Receive Complete Interrupt         */
            uint8_t  : 5;      /*!< bit:  3.. 7  Reserved                           */
        } bit;                 /*!< Structure used for bit  access                  */
        uint8_t reg;           /*!< Type      used for register access              */
    } SERCOM_SPI_INTFLAG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SERCOM_SPI_INTFLAG_OFFSET        0x0E    /**< \brief (SERCOM_SPI_INTFLAG offset) SPI Interrupt Flag Status and Clear Register */
#define SERCOM_SPI_INTFLAG_RESETVALUE    0x00    /**< \brief (SERCOM_SPI_INTFLAG reset_value) SPI Interrupt Flag Status and Clear Register */

#define SERCOM_SPI_INTFLAG_DRE_Pos       0       /**< \brief (SERCOM_SPI_INTFLAG) Data Register Empty Interrupt */
#define SERCOM_SPI_INTFLAG_DRE           ( 0x1u << SERCOM_SPI_INTFLAG_DRE_Pos )
#define SERCOM_SPI_INTFLAG_TXC_Pos       1       /**< \brief (SERCOM_SPI_INTFLAG) Transmit Complete Interrupt */
#define SERCOM_SPI_INTFLAG_TXC           ( 0x1u << SERCOM_SPI_INTFLAG_TXC_Pos )
#define SERCOM_SPI_INTFLAG_RXC_Pos       2       /**< \brief (SERCOM_SPI_INTFLAG) Receive Complete Interrupt */
#define SERCOM_SPI_INTFLAG_RXC           ( 0x1u << SERCOM_SPI_INTFLAG_RXC_Pos )
#define SERCOM_SPI_INTFLAG_MASK          0x07u   /**< \brief (SERCOM_SPI_INTFLAG) MASK Register */

/* -------- SERCOM_USART_INTFLAG : (SERCOM Offset: 0x0E) (R/W  8) USART USART Interrupt Flag Status and Clear Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t DRE : 1;   /*!< bit:      0  Data Register Empty Interrupt      */
            uint8_t TXC : 1;   /*!< bit:      1  Transmit Complete Interrupt        */
            uint8_t RXC : 1;   /*!< bit:      2  Receive Complete Interrupt         */
            uint8_t RXS : 1;   /*!< bit:      3  Receive Start Interrupt            */
            uint8_t  : 4;      /*!< bit:  4.. 7  Reserved                           */
        } bit;                 /*!< Structure used for bit  access                  */
        uint8_t reg;           /*!< Type      used for register access              */
    } SERCOM_USART_INTFLAG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SERCOM_USART_INTFLAG_OFFSET        0x0E  /**< \brief (SERCOM_USART_INTFLAG offset) USART Interrupt Flag Status and Clear Register */
#define SERCOM_USART_INTFLAG_RESETVALUE    0x00  /**< \brief (SERCOM_USART_INTFLAG reset_value) USART Interrupt Flag Status and Clear Register */

#define SERCOM_USART_INTFLAG_DRE_Pos       0     /**< \brief (SERCOM_USART_INTFLAG) Data Register Empty Interrupt */
#define SERCOM_USART_INTFLAG_DRE           ( 0x1u << SERCOM_USART_INTFLAG_DRE_Pos )
#define SERCOM_USART_INTFLAG_TXC_Pos       1     /**< \brief (SERCOM_USART_INTFLAG) Transmit Complete Interrupt */
#define SERCOM_USART_INTFLAG_TXC           ( 0x1u << SERCOM_USART_INTFLAG_TXC_Pos )
#define SERCOM_USART_INTFLAG_RXC_Pos       2     /**< \brief (SERCOM_USART_INTFLAG) Receive Complete Interrupt */
#define SERCOM_USART_INTFLAG_RXC           ( 0x1u << SERCOM_USART_INTFLAG_RXC_Pos )
#define SERCOM_USART_INTFLAG_RXS_Pos       3     /**< \brief (SERCOM_USART_INTFLAG) Receive Start Interrupt */
#define SERCOM_USART_INTFLAG_RXS           ( 0x1u << SERCOM_USART_INTFLAG_RXS_Pos )
#define SERCOM_USART_INTFLAG_MASK          0x0Fu /**< \brief (SERCOM_USART_INTFLAG) MASK Register */

/* -------- SERCOM_I2CM_STATUS : (SERCOM Offset: 0x10) (R/W 16) I2CM I2CM Status Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint16_t BUSERR : 1;   /*!< bit:      0  Bus Error                          */
            uint16_t ARBLOST : 1;  /*!< bit:      1  Arbitration Lost                   */
            uint16_t RXNACK : 1;   /*!< bit:      2  Received Not Acknowledge           */
            uint16_t : 1;          /*!< bit:      3  Reserved                           */
            uint16_t BUSSTATE : 2; /*!< bit:  4.. 5  Bus State                          */
            uint16_t LOWTOUT : 1;  /*!< bit:      6  SCL Low Timeout                    */
            uint16_t CLKHOLD : 1;  /*!< bit:      7  Clock Hold                         */
            uint16_t : 7;          /*!< bit:  8..14  Reserved                           */
            uint16_t SYNCBUSY : 1; /*!< bit:     15  Synchronization Busy               */
        } bit;                     /*!< Structure used for bit  access                  */
        uint16_t reg;              /*!< Type      used for register access              */
    } SERCOM_I2CM_STATUS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SERCOM_I2CM_STATUS_OFFSET          0x10   /**< \brief (SERCOM_I2CM_STATUS offset) I2CM Status Register */
#define SERCOM_I2CM_STATUS_RESETVALUE      0x0000 /**< \brief (SERCOM_I2CM_STATUS reset_value) I2CM Status Register */

#define SERCOM_I2CM_STATUS_BUSERR_Pos      0      /**< \brief (SERCOM_I2CM_STATUS) Bus Error */
#define SERCOM_I2CM_STATUS_BUSERR          ( 0x1u << SERCOM_I2CM_STATUS_BUSERR_Pos )
#define SERCOM_I2CM_STATUS_ARBLOST_Pos     1      /**< \brief (SERCOM_I2CM_STATUS) Arbitration Lost */
#define SERCOM_I2CM_STATUS_ARBLOST         ( 0x1u << SERCOM_I2CM_STATUS_ARBLOST_Pos )
#define SERCOM_I2CM_STATUS_RXNACK_Pos      2      /**< \brief (SERCOM_I2CM_STATUS) Received Not Acknowledge */
#define SERCOM_I2CM_STATUS_RXNACK          ( 0x1u << SERCOM_I2CM_STATUS_RXNACK_Pos )
#define SERCOM_I2CM_STATUS_BUSSTATE_Pos    4      /**< \brief (SERCOM_I2CM_STATUS) Bus State */
#define SERCOM_I2CM_STATUS_BUSSTATE_Msk    ( 0x3u << SERCOM_I2CM_STATUS_BUSSTATE_Pos )
#define SERCOM_I2CM_STATUS_BUSSTATE( value )    ( ( SERCOM_I2CM_STATUS_BUSSTATE_Msk & ( ( value ) << SERCOM_I2CM_STATUS_BUSSTATE_Pos ) ) )
#define SERCOM_I2CM_STATUS_LOWTOUT_Pos     6       /**< \brief (SERCOM_I2CM_STATUS) SCL Low Timeout */
#define SERCOM_I2CM_STATUS_LOWTOUT         ( 0x1u << SERCOM_I2CM_STATUS_LOWTOUT_Pos )
#define SERCOM_I2CM_STATUS_CLKHOLD_Pos     7       /**< \brief (SERCOM_I2CM_STATUS) Clock Hold */
#define SERCOM_I2CM_STATUS_CLKHOLD         ( 0x1u << SERCOM_I2CM_STATUS_CLKHOLD_Pos )
#define SERCOM_I2CM_STATUS_SYNCBUSY_Pos    15      /**< \brief (SERCOM_I2CM_STATUS) Synchronization Busy */
#define SERCOM_I2CM_STATUS_SYNCBUSY        ( 0x1u << SERCOM_I2CM_STATUS_SYNCBUSY_Pos )
#define SERCOM_I2CM_STATUS_MASK            0x80F7u /**< \brief (SERCOM_I2CM_STATUS) MASK Register */

/* -------- SERCOM_I2CS_STATUS : (SERCOM Offset: 0x10) (R/W 16) I2CS I2CS Status Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint16_t BUSERR : 1;   /*!< bit:      0  Bus Error                          */
            uint16_t COLL : 1;     /*!< bit:      1  Transmit Collision                 */
            uint16_t RXNACK : 1;   /*!< bit:      2  Received Not Acknowledge           */
            uint16_t DIR : 1;      /*!< bit:      3  Read/Write Direction               */
            uint16_t SR : 1;       /*!< bit:      4  Repeated Start                     */
            uint16_t : 1;          /*!< bit:      5  Reserved                           */
            uint16_t LOWTOUT : 1;  /*!< bit:      6  SCL Low Timeout                    */
            uint16_t CLKHOLD : 1;  /*!< bit:      7  Clock Hold                         */
            uint16_t : 7;          /*!< bit:  8..14  Reserved                           */
            uint16_t SYNCBUSY : 1; /*!< bit:     15  Synchronization Busy               */
        } bit;                     /*!< Structure used for bit  access                  */
        uint16_t reg;              /*!< Type      used for register access              */
    } SERCOM_I2CS_STATUS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SERCOM_I2CS_STATUS_OFFSET          0x10    /**< \brief (SERCOM_I2CS_STATUS offset) I2CS Status Register */
#define SERCOM_I2CS_STATUS_RESETVALUE      0x0000  /**< \brief (SERCOM_I2CS_STATUS reset_value) I2CS Status Register */

#define SERCOM_I2CS_STATUS_BUSERR_Pos      0       /**< \brief (SERCOM_I2CS_STATUS) Bus Error */
#define SERCOM_I2CS_STATUS_BUSERR          ( 0x1u << SERCOM_I2CS_STATUS_BUSERR_Pos )
#define SERCOM_I2CS_STATUS_COLL_Pos        1       /**< \brief (SERCOM_I2CS_STATUS) Transmit Collision */
#define SERCOM_I2CS_STATUS_COLL            ( 0x1u << SERCOM_I2CS_STATUS_COLL_Pos )
#define SERCOM_I2CS_STATUS_RXNACK_Pos      2       /**< \brief (SERCOM_I2CS_STATUS) Received Not Acknowledge */
#define SERCOM_I2CS_STATUS_RXNACK          ( 0x1u << SERCOM_I2CS_STATUS_RXNACK_Pos )
#define SERCOM_I2CS_STATUS_DIR_Pos         3       /**< \brief (SERCOM_I2CS_STATUS) Read/Write Direction */
#define SERCOM_I2CS_STATUS_DIR             ( 0x1u << SERCOM_I2CS_STATUS_DIR_Pos )
#define SERCOM_I2CS_STATUS_SR_Pos          4       /**< \brief (SERCOM_I2CS_STATUS) Repeated Start */
#define SERCOM_I2CS_STATUS_SR              ( 0x1u << SERCOM_I2CS_STATUS_SR_Pos )
#define SERCOM_I2CS_STATUS_LOWTOUT_Pos     6       /**< \brief (SERCOM_I2CS_STATUS) SCL Low Timeout */
#define SERCOM_I2CS_STATUS_LOWTOUT         ( 0x1u << SERCOM_I2CS_STATUS_LOWTOUT_Pos )
#define SERCOM_I2CS_STATUS_CLKHOLD_Pos     7       /**< \brief (SERCOM_I2CS_STATUS) Clock Hold */
#define SERCOM_I2CS_STATUS_CLKHOLD         ( 0x1u << SERCOM_I2CS_STATUS_CLKHOLD_Pos )
#define SERCOM_I2CS_STATUS_SYNCBUSY_Pos    15      /**< \brief (SERCOM_I2CS_STATUS) Synchronization Busy */
#define SERCOM_I2CS_STATUS_SYNCBUSY        ( 0x1u << SERCOM_I2CS_STATUS_SYNCBUSY_Pos )
#define SERCOM_I2CS_STATUS_MASK            0x80DFu /**< \brief (SERCOM_I2CS_STATUS) MASK Register */

/* -------- SERCOM_SPI_STATUS : (SERCOM Offset: 0x10) (R/W 16) SPI SPI Status Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint16_t : 2;          /*!< bit:  0.. 1  Reserved                           */
            uint16_t BUFOVF : 1;   /*!< bit:      2  Buffer Overflow                    */
            uint16_t : 12;         /*!< bit:  3..14  Reserved                           */
            uint16_t SYNCBUSY : 1; /*!< bit:     15  Synchronization Busy               */
        } bit;                     /*!< Structure used for bit  access                  */
        uint16_t reg;              /*!< Type      used for register access              */
    } SERCOM_SPI_STATUS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SERCOM_SPI_STATUS_OFFSET          0x10    /**< \brief (SERCOM_SPI_STATUS offset) SPI Status Register */
#define SERCOM_SPI_STATUS_RESETVALUE      0x0000  /**< \brief (SERCOM_SPI_STATUS reset_value) SPI Status Register */

#define SERCOM_SPI_STATUS_BUFOVF_Pos      2       /**< \brief (SERCOM_SPI_STATUS) Buffer Overflow */
#define SERCOM_SPI_STATUS_BUFOVF          ( 0x1u << SERCOM_SPI_STATUS_BUFOVF_Pos )
#define SERCOM_SPI_STATUS_SYNCBUSY_Pos    15      /**< \brief (SERCOM_SPI_STATUS) Synchronization Busy */
#define SERCOM_SPI_STATUS_SYNCBUSY        ( 0x1u << SERCOM_SPI_STATUS_SYNCBUSY_Pos )
#define SERCOM_SPI_STATUS_MASK            0x8004u /**< \brief (SERCOM_SPI_STATUS) MASK Register */

/* -------- SERCOM_USART_STATUS : (SERCOM Offset: 0x10) (R/W 16) USART USART Status Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint16_t PERR : 1;     /*!< bit:      0  Parity Error                       */
            uint16_t FERR : 1;     /*!< bit:      1  Frame Error                        */
            uint16_t BUFOVF : 1;   /*!< bit:      2  Buffer Overflow                    */
            uint16_t : 12;         /*!< bit:  3..14  Reserved                           */
            uint16_t SYNCBUSY : 1; /*!< bit:     15  Synchronization Busy               */
        } bit;                     /*!< Structure used for bit  access                  */
        uint16_t reg;              /*!< Type      used for register access              */
    } SERCOM_USART_STATUS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SERCOM_USART_STATUS_OFFSET          0x10    /**< \brief (SERCOM_USART_STATUS offset) USART Status Register */
#define SERCOM_USART_STATUS_RESETVALUE      0x0000  /**< \brief (SERCOM_USART_STATUS reset_value) USART Status Register */

#define SERCOM_USART_STATUS_PERR_Pos        0       /**< \brief (SERCOM_USART_STATUS) Parity Error */
#define SERCOM_USART_STATUS_PERR            ( 0x1u << SERCOM_USART_STATUS_PERR_Pos )
#define SERCOM_USART_STATUS_FERR_Pos        1       /**< \brief (SERCOM_USART_STATUS) Frame Error */
#define SERCOM_USART_STATUS_FERR            ( 0x1u << SERCOM_USART_STATUS_FERR_Pos )
#define SERCOM_USART_STATUS_BUFOVF_Pos      2       /**< \brief (SERCOM_USART_STATUS) Buffer Overflow */
#define SERCOM_USART_STATUS_BUFOVF          ( 0x1u << SERCOM_USART_STATUS_BUFOVF_Pos )
#define SERCOM_USART_STATUS_SYNCBUSY_Pos    15      /**< \brief (SERCOM_USART_STATUS) Synchronization Busy */
#define SERCOM_USART_STATUS_SYNCBUSY        ( 0x1u << SERCOM_USART_STATUS_SYNCBUSY_Pos )
#define SERCOM_USART_STATUS_MASK            0x8007u /**< \brief (SERCOM_USART_STATUS) MASK Register */

/* -------- SERCOM_I2CM_ADDR : (SERCOM Offset: 0x14) (R/W  8) I2CM I2CM Address Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t ADDR : 8;  /*!< bit:  0.. 7  Address Value                      */
        } bit;                 /*!< Structure used for bit  access                  */
        uint8_t reg;           /*!< Type      used for register access              */
    } SERCOM_I2CM_ADDR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SERCOM_I2CM_ADDR_OFFSET        0x14      /**< \brief (SERCOM_I2CM_ADDR offset) I2CM Address Register */
#define SERCOM_I2CM_ADDR_RESETVALUE    0x00      /**< \brief (SERCOM_I2CM_ADDR reset_value) I2CM Address Register */

#define SERCOM_I2CM_ADDR_ADDR_Pos      0         /**< \brief (SERCOM_I2CM_ADDR) Address Value */
#define SERCOM_I2CM_ADDR_ADDR_Msk      ( 0xFFu << SERCOM_I2CM_ADDR_ADDR_Pos )
#define SERCOM_I2CM_ADDR_ADDR( value )    ( ( SERCOM_I2CM_ADDR_ADDR_Msk & ( ( value ) << SERCOM_I2CM_ADDR_ADDR_Pos ) ) )
#define SERCOM_I2CM_ADDR_MASK          0xFFu     /**< \brief (SERCOM_I2CM_ADDR) MASK Register */

/* -------- SERCOM_I2CS_ADDR : (SERCOM Offset: 0x14) (R/W 32) I2CS I2CS Address Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t GENCEN : 1;   /*!< bit:      0  General Call Address Enable        */
            uint32_t ADDR : 7;     /*!< bit:  1.. 7  Address Value                      */
            uint32_t : 9;          /*!< bit:  8..16  Reserved                           */
            uint32_t ADDRMASK : 7; /*!< bit: 17..23  Address Mask                       */
            uint32_t : 8;          /*!< bit: 24..31  Reserved                           */
        } bit;                     /*!< Structure used for bit  access                  */
        uint32_t reg;              /*!< Type      used for register access              */
    } SERCOM_I2CS_ADDR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SERCOM_I2CS_ADDR_OFFSET          0x14       /**< \brief (SERCOM_I2CS_ADDR offset) I2CS Address Register */
#define SERCOM_I2CS_ADDR_RESETVALUE      0x00000000 /**< \brief (SERCOM_I2CS_ADDR reset_value) I2CS Address Register */

#define SERCOM_I2CS_ADDR_GENCEN_Pos      0          /**< \brief (SERCOM_I2CS_ADDR) General Call Address Enable */
#define SERCOM_I2CS_ADDR_GENCEN          ( 0x1u << SERCOM_I2CS_ADDR_GENCEN_Pos )
#define SERCOM_I2CS_ADDR_ADDR_Pos        1          /**< \brief (SERCOM_I2CS_ADDR) Address Value */
#define SERCOM_I2CS_ADDR_ADDR_Msk        ( 0x7Fu << SERCOM_I2CS_ADDR_ADDR_Pos )
#define SERCOM_I2CS_ADDR_ADDR( value )        ( ( SERCOM_I2CS_ADDR_ADDR_Msk & ( ( value ) << SERCOM_I2CS_ADDR_ADDR_Pos ) ) )
#define SERCOM_I2CS_ADDR_ADDRMASK_Pos    17        /**< \brief (SERCOM_I2CS_ADDR) Address Mask */
#define SERCOM_I2CS_ADDR_ADDRMASK_Msk    ( 0x7Fu << SERCOM_I2CS_ADDR_ADDRMASK_Pos )
#define SERCOM_I2CS_ADDR_ADDRMASK( value )    ( ( SERCOM_I2CS_ADDR_ADDRMASK_Msk & ( ( value ) << SERCOM_I2CS_ADDR_ADDRMASK_Pos ) ) )
#define SERCOM_I2CS_ADDR_MASK            0x00FE00FFu /**< \brief (SERCOM_I2CS_ADDR) MASK Register */

/* -------- SERCOM_SPI_ADDR : (SERCOM Offset: 0x14) (R/W 32) SPI SPI Address Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t ADDR : 8;     /*!< bit:  0.. 7  Address Value                      */
            uint32_t : 8;          /*!< bit:  8..15  Reserved                           */
            uint32_t ADDRMASK : 8; /*!< bit: 16..23  Address Mask                       */
            uint32_t : 8;          /*!< bit: 24..31  Reserved                           */
        } bit;                     /*!< Structure used for bit  access                  */
        uint32_t reg;              /*!< Type      used for register access              */
    } SERCOM_SPI_ADDR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SERCOM_SPI_ADDR_OFFSET          0x14       /**< \brief (SERCOM_SPI_ADDR offset) SPI Address Register */
#define SERCOM_SPI_ADDR_RESETVALUE      0x00000000 /**< \brief (SERCOM_SPI_ADDR reset_value) SPI Address Register */

#define SERCOM_SPI_ADDR_ADDR_Pos        0          /**< \brief (SERCOM_SPI_ADDR) Address Value */
#define SERCOM_SPI_ADDR_ADDR_Msk        ( 0xFFu << SERCOM_SPI_ADDR_ADDR_Pos )
#define SERCOM_SPI_ADDR_ADDR( value )        ( ( SERCOM_SPI_ADDR_ADDR_Msk & ( ( value ) << SERCOM_SPI_ADDR_ADDR_Pos ) ) )
#define SERCOM_SPI_ADDR_ADDRMASK_Pos    16        /**< \brief (SERCOM_SPI_ADDR) Address Mask */
#define SERCOM_SPI_ADDR_ADDRMASK_Msk    ( 0xFFu << SERCOM_SPI_ADDR_ADDRMASK_Pos )
#define SERCOM_SPI_ADDR_ADDRMASK( value )    ( ( SERCOM_SPI_ADDR_ADDRMASK_Msk & ( ( value ) << SERCOM_SPI_ADDR_ADDRMASK_Pos ) ) )
#define SERCOM_SPI_ADDR_MASK            0x00FF00FFu /**< \brief (SERCOM_SPI_ADDR) MASK Register */

/* -------- SERCOM_I2CM_DATA : (SERCOM Offset: 0x18) (R/W  8) I2CM I2CM Data Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t DATA : 8;  /*!< bit:  0.. 7  Data Value                         */
        } bit;                 /*!< Structure used for bit  access                  */
        uint8_t reg;           /*!< Type      used for register access              */
    } SERCOM_I2CM_DATA_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SERCOM_I2CM_DATA_OFFSET        0x18      /**< \brief (SERCOM_I2CM_DATA offset) I2CM Data Register */
#define SERCOM_I2CM_DATA_RESETVALUE    0x00      /**< \brief (SERCOM_I2CM_DATA reset_value) I2CM Data Register */

#define SERCOM_I2CM_DATA_DATA_Pos      0         /**< \brief (SERCOM_I2CM_DATA) Data Value */
#define SERCOM_I2CM_DATA_DATA_Msk      ( 0xFFu << SERCOM_I2CM_DATA_DATA_Pos )
#define SERCOM_I2CM_DATA_DATA( value )    ( ( SERCOM_I2CM_DATA_DATA_Msk & ( ( value ) << SERCOM_I2CM_DATA_DATA_Pos ) ) )
#define SERCOM_I2CM_DATA_MASK          0xFFu     /**< \brief (SERCOM_I2CM_DATA) MASK Register */

/* -------- SERCOM_I2CS_DATA : (SERCOM Offset: 0x18) (R/W  8) I2CS I2CS Data Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t DATA : 8;  /*!< bit:  0.. 7  Data Value                         */
        } bit;                 /*!< Structure used for bit  access                  */
        uint8_t reg;           /*!< Type      used for register access              */
    } SERCOM_I2CS_DATA_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SERCOM_I2CS_DATA_OFFSET        0x18      /**< \brief (SERCOM_I2CS_DATA offset) I2CS Data Register */
#define SERCOM_I2CS_DATA_RESETVALUE    0x00      /**< \brief (SERCOM_I2CS_DATA reset_value) I2CS Data Register */

#define SERCOM_I2CS_DATA_DATA_Pos      0         /**< \brief (SERCOM_I2CS_DATA) Data Value */
#define SERCOM_I2CS_DATA_DATA_Msk      ( 0xFFu << SERCOM_I2CS_DATA_DATA_Pos )
#define SERCOM_I2CS_DATA_DATA( value )    ( ( SERCOM_I2CS_DATA_DATA_Msk & ( ( value ) << SERCOM_I2CS_DATA_DATA_Pos ) ) )
#define SERCOM_I2CS_DATA_MASK          0xFFu     /**< \brief (SERCOM_I2CS_DATA) MASK Register */

