FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/component/component_sercom.h
/* -------- SERCOM_SPI_DATA : (SERCOM Offset: 0x18) (R/W 16) SPI SPI Data Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint16_t DATA : 9; /*!< bit:  0.. 8  Data Value                         */
            uint16_t : 7;      /*!< bit:  9..15  Reserved                           */
        } bit;                 /*!< Structure used for bit  access                  */
        uint16_t reg;          /*!< Type      used for register access              */
    } SERCOM_SPI_DATA_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SERCOM_SPI_DATA_OFFSET        0x18       /**< \brief (SERCOM_SPI_DATA offset) SPI Data Register */
#define SERCOM_SPI_DATA_RESETVALUE    0x0000     /**< \brief (SERCOM_SPI_DATA reset_value) SPI Data Register */

#define SERCOM_SPI_DATA_DATA_Pos      0          /**< \brief (SERCOM_SPI_DATA) Data Value */
#define SERCOM_SPI_DATA_DATA_Msk      ( 0x1FFu << SERCOM_SPI_DATA_DATA_Pos )
#define SERCOM_SPI_DATA_DATA( value )    ( ( SERCOM_SPI_DATA_DATA_Msk & ( ( value ) << SERCOM_SPI_DATA_DATA_Pos ) ) )
#define SERCOM_SPI_DATA_MASK          0x01FFu    /**< \brief (SERCOM_SPI_DATA) MASK Register */

/* -------- SERCOM_USART_DATA : (SERCOM Offset: 0x18) (R/W 16) USART USART Data Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint16_t DATA : 9; /*!< bit:  0.. 8  Data Value                         */
            uint16_t : 7;      /*!< bit:  9..15  Reserved                           */
        } bit;                 /*!< Structure used for bit  access                  */
        uint16_t reg;          /*!< Type      used for register access              */
    } SERCOM_USART_DATA_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SERCOM_USART_DATA_OFFSET        0x18     /**< \brief (SERCOM_USART_DATA offset) USART Data Register */
#define SERCOM_USART_DATA_RESETVALUE    0x0000   /**< \brief (SERCOM_USART_DATA reset_value) USART Data Register */

#define SERCOM_USART_DATA_DATA_Pos      0        /**< \brief (SERCOM_USART_DATA) Data Value */
#define SERCOM_USART_DATA_DATA_Msk      ( 0x1FFu << SERCOM_USART_DATA_DATA_Pos )
#define SERCOM_USART_DATA_DATA( value )    ( ( SERCOM_USART_DATA_DATA_Msk & ( ( value ) << SERCOM_USART_DATA_DATA_Pos ) ) )
#define SERCOM_USART_DATA_MASK          0x01FFu  /**< \brief (SERCOM_USART_DATA) MASK Register */

/** \brief SERCOM_I2CM hardware registers */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef struct                               /* I2C Master Mode */
    {
        __IO SERCOM_I2CM_CTRLA_Type CTRLA;       /**< \brief Offset: 0x00 (R/W 32) I2CM Control Register A */
        __IO SERCOM_I2CM_CTRLB_Type CTRLB;       /**< \brief Offset: 0x04 (R/W 32) I2CM Control Register B */
        __IO SERCOM_I2CM_DBGCTRL_Type DBGCTRL;   /**< \brief Offset: 0x08 (R/W  8) I2CM Debug Register */
        RoReg8 Reserved1[ 0x1 ];
        __IO SERCOM_I2CM_BAUD_Type BAUD;         /**< \brief Offset: 0x0A (R/W 16) I2CM Baud Rate Register */
        __IO SERCOM_I2CM_INTENCLR_Type INTENCLR; /**< \brief Offset: 0x0C (R/W  8) I2CM Interrupt Enable Clear Register */
        __IO SERCOM_I2CM_INTENSET_Type INTENSET; /**< \brief Offset: 0x0D (R/W  8) I2CM Interrupt Enable Set Register */
        __IO SERCOM_I2CM_INTFLAG_Type INTFLAG;   /**< \brief Offset: 0x0E (R/W  8) I2CM Interrupt Flag Status and Clear Register */
        RoReg8 Reserved2[ 0x1 ];
        __IO SERCOM_I2CM_STATUS_Type STATUS;     /**< \brief Offset: 0x10 (R/W 16) I2CM Status Register */
        RoReg8 Reserved3[ 0x2 ];
        __IO SERCOM_I2CM_ADDR_Type ADDR;         /**< \brief Offset: 0x14 (R/W  8) I2CM Address Register */
        RoReg8 Reserved4[ 0x3 ];
        __IO SERCOM_I2CM_DATA_Type DATA;         /**< \brief Offset: 0x18 (R/W  8) I2CM Data Register */
    } SercomI2cm;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/** \brief SERCOM_I2CS hardware registers */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef struct                               /* I2C Slave Mode */
    {
        __IO SERCOM_I2CS_CTRLA_Type CTRLA;       /**< \brief Offset: 0x00 (R/W 32) I2CS Control Register A */
        __IO SERCOM_I2CS_CTRLB_Type CTRLB;       /**< \brief Offset: 0x04 (R/W 32) I2CS Control Register B */
        RoReg8 Reserved1[ 0x4 ];
        __IO SERCOM_I2CS_INTENCLR_Type INTENCLR; /**< \brief Offset: 0x0C (R/W  8) I2CS Interrupt Enable Clear Register */
        __IO SERCOM_I2CS_INTENSET_Type INTENSET; /**< \brief Offset: 0x0D (R/W  8) I2CS Interrupt Enable Set Register */
        __IO SERCOM_I2CS_INTFLAG_Type INTFLAG;   /**< \brief Offset: 0x0E (R/W  8) I2CS Interrupt Flag Status and Clear Register */
        RoReg8 Reserved2[ 0x1 ];
        __IO SERCOM_I2CS_STATUS_Type STATUS;     /**< \brief Offset: 0x10 (R/W 16) I2CS Status Register */
        RoReg8 Reserved3[ 0x2 ];
        __IO SERCOM_I2CS_ADDR_Type ADDR;         /**< \brief Offset: 0x14 (R/W 32) I2CS Address Register */
        __IO SERCOM_I2CS_DATA_Type DATA;         /**< \brief Offset: 0x18 (R/W  8) I2CS Data Register */
    } SercomI2cs;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/** \brief SERCOM_SPI hardware registers */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef struct                              /* SPI Mode */
    {
        __IO SERCOM_SPI_CTRLA_Type CTRLA;       /**< \brief Offset: 0x00 (R/W 32) SPI Control Register A */
        __IO SERCOM_SPI_CTRLB_Type CTRLB;       /**< \brief Offset: 0x04 (R/W 32) SPI Control Register B */
        __IO SERCOM_SPI_DBGCTRL_Type DBGCTRL;   /**< \brief Offset: 0x08 (R/W  8) SPI Debug Register */
        RoReg8 Reserved1[ 0x1 ];
        __IO SERCOM_SPI_BAUD_Type BAUD;         /**< \brief Offset: 0x0A (R/W  8) SPI Baud Rate Register */
        RoReg8 Reserved2[ 0x1 ];
        __IO SERCOM_SPI_INTENCLR_Type INTENCLR; /**< \brief Offset: 0x0C (R/W  8) SPI Interrupt Enable Clear Register */
        __IO SERCOM_SPI_INTENSET_Type INTENSET; /**< \brief Offset: 0x0D (R/W  8) SPI Interrupt Enable Set Register */
        __IO SERCOM_SPI_INTFLAG_Type INTFLAG;   /**< \brief Offset: 0x0E (R/W  8) SPI Interrupt Flag Status and Clear Register */
        RoReg8 Reserved3[ 0x1 ];
        __IO SERCOM_SPI_STATUS_Type STATUS;     /**< \brief Offset: 0x10 (R/W 16) SPI Status Register */
        RoReg8 Reserved4[ 0x2 ];
        __IO SERCOM_SPI_ADDR_Type ADDR;         /**< \brief Offset: 0x14 (R/W 32) SPI Address Register */
        __IO SERCOM_SPI_DATA_Type DATA;         /**< \brief Offset: 0x18 (R/W 16) SPI Data Register */
    } SercomSpi;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/** \brief SERCOM_USART hardware registers */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef struct                                /* USART Mode */
    {
        __IO SERCOM_USART_CTRLA_Type CTRLA;       /**< \brief Offset: 0x00 (R/W 32) USART Control Register A */
        __IO SERCOM_USART_CTRLB_Type CTRLB;       /**< \brief Offset: 0x04 (R/W 32) USART Control Register B */
        __IO SERCOM_USART_DBGCTRL_Type DBGCTRL;   /**< \brief Offset: 0x08 (R/W  8) USART Debug Register */
        RoReg8 Reserved1[ 0x1 ];
        __IO SERCOM_USART_BAUD_Type BAUD;         /**< \brief Offset: 0x0A (R/W 16) USART Baud Rate Register */
        __IO SERCOM_USART_INTENCLR_Type INTENCLR; /**< \brief Offset: 0x0C (R/W  8) USART Interrupt Enable Clear Register */
        __IO SERCOM_USART_INTENSET_Type INTENSET; /**< \brief Offset: 0x0D (R/W  8) USART Interrupt Enable Set Register */
        __IO SERCOM_USART_INTFLAG_Type INTFLAG;   /**< \brief Offset: 0x0E (R/W  8) USART Interrupt Flag Status and Clear Register */
        RoReg8 Reserved2[ 0x1 ];
        __IO SERCOM_USART_STATUS_Type STATUS;     /**< \brief Offset: 0x10 (R/W 16) USART Status Register */
        RoReg8 Reserved3[ 0x6 ];
        __IO SERCOM_USART_DATA_Type DATA;         /**< \brief Offset: 0x18 (R/W 16) USART Data Register */
    } SercomUsart;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        SercomI2cm I2CM;                      /**< \brief Offset: 0x00 I2C Master Mode */
        SercomI2cs I2CS;                      /**< \brief Offset: 0x00 I2C Slave Mode */
        SercomSpi SPI;                        /**< \brief Offset: 0x00 SPI Mode */
        SercomUsart USART;                    /**< \brief Offset: 0x00 USART Mode */
    } Sercom;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/*@}*/

#endif /* _SAMD20_SERCOM_COMPONENT_ */
